Revit 2024 API
AirSystemData.PreheatHotWaterLoopId Property
 The water loop element id for the hot-water preheat coil.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020.1
Syntax
C#
public ElementId PreheatHotWaterLoopId { get; set; }
Visual Basic
Public Property PreheatHotWaterLoopId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ PreheatHotWaterLoopId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
AirSystemData Class
Autodesk.Revit.DB.Mechanical Namespace